[{"userId":"66cf1d20382ff6f8b524e666","userName":"Alumni1","experiences":["As a team leader, I developed various skills, learned Google technologies and leadership, networked with many enthusiasts, and motivated club students to learn new technologies.","Being Cybersecurity Interest Group Facilitator, I have been curating courses and tasks for Cybersecurity in GTech Mulearn along with my team with the help of Expert Mentors, along with conducting office hours with the students once every week and having a healthy discussion about the Cybersecurity topic with them and making their interest work.","Selected as Campus Ambassador for my college, College of Engineering Chengannur for 2nd time in IEEEXtreme 17.0. Working on collaborating with my IEEE Student Branch and expanding the reach of IEEEXtreme."],"location":"mumbai","interests":["C++","KALI LINUX","web development","python"]},{"userId":"66d0086957fe60f99f033d7f","userName":"student1","experiences":[],"location":"","interests":[]},{"userId":"66d008e757fe60f99f033d83","userName":"student2","experiences":[],"location":"kollam","interests":["C++"]},{"userId":"66d32af957fe60f99f033d8b","userName":"alumni2","experiences":["It fills me with immense joy to share that my journey from a PRO to the President has been an incredibly rewarding one. This promotion is a testament to my passion and dedication towards my work.\r\n\r\n\r\nI would like to express my heartfelt gratitude to the entire PRODDEC family for their constant support and belief in my abilities. It is through their guidance and encouragement that I have been able to reach this Milestone in my career. I am truly fortunate to be surrounded by such a talented and inspiring group of individuals.","It fills me with immense joy to share that my journey from a data collection incharge to the Student Lead has been an incredibly rewarding one. This promotion is a testament to my passion and dedication towards my work.\r\n\r\n\r\nI would like to express my heartfelt gratitude to the entire ARC family for their constant support and belief in my abilities. It is through their guidance and encouragement that I have been able to reach this Milestone in my career. I am truly fortunate to be surrounded by such a talented and inspiring group of individuals.","Managing NSS social media pages allowed me to develop skills in social media management.\r\nGained experience in creating and scheduling content, engaging with followers, managing comments and messages, and monitoring analytics.\r\n\r\nAs a manager of NSS social media pages, i had the opportunity to interact with a diverse audience comprising volunteers, stakeholders, and the general public. This experience helps me refine my communication skills, including writing engaging posts, responding to queries, and fostering meaningful discussions. It also provides an understanding of how to effectively engage with an online community.\r\n\r\nManaging media pages involves promoting the organization's mission, values, and initiatives. l had gained experience in developing a consistent brand voice, posting visually appealing content, and crafting compelling messages to increase awareness and engagement\r\n\r\nLearned how to address concerns, resolve conflicts, and maintain a positive online reputation as social media pages face challenges such as negative feedback, complaints, or misinformation. Managing NSS socia media pages allowed me to develop skills in handling such situations with professionalism, tact\r\n\r\nOffers an opportunity to develop coordination and teamwork skills, ensuring consistent messaging and collaborative content creation.","Got a chance to work as a campus ambassador for Techmaghi Internship programmes and E- learniing courses\r\n\r\nAs a campuss ambassodor for techmaghi, i reffered more than 100 students for their various programmes and managed to ensure that those participants aquired knowledge from curresponding courses\r\n\r\nMade techmaghi as a sponsor in a national level techfest IHRD THARANG conducted in out college\r\n\r\nAs a campus ambassador, i have the opportunity to develop and enhance my leadership abilities.\r\nEngaging with students, faculty, and staff helps me refine my communication abilities and become a confident and persuasive speaker.\r\n\r\nOne of the primary responsibilities is to establish connections and build relationships with students, faculty members, and administrators. This helped in networking and relationship building\r\n \r\nGained experience in implementing marketing strategies, creating promotional materials, and engaging with studentsGot a chance to work as a campus ambassador for Techmaghi Internship programmes and E- learniing courses As a campuss ambassodor for techmaghi, i reffered more than 100 students for their various programmes and managed to ensure that those participants aquired knowledge from curresponding courses Made techmaghi as a sponsor in a national level techfest IHRD THARANG conducted in out college As a campus ambassador, i have the opportunity to develop and enhance my leadership abilities. Engaging with students, faculty, and staff helps me refine my communication abilities and become a confident and persuasive speaker. One of the primary responsibilities is to establish connections and build relationships with students, faculty members, and administrators. This helped in networking and relationship building Gained experience in implementing marketing strategies, creating promotional materials, and engaging with students\r\nSkills: Communication · Team Leadership · Sales · Campus Management · Marketing Management · Strategic Communications · Leadership · Team Management · Community Development","Got a chance to handle handle social media pages and being part of various committees for a national level techfest IHRD THARANG hosted in our college.\r\n\r\nHelped in gaining knowledge in problem solving and multitasking.\r\n\r\nGained many connections and expert advices from all across the world. \r\n\r\nBeing part of the sponsorship committee was something different.\r\nGot expert advices from proffessional alumni across the world and managed to make a connection with them.\r\nMe and my team partner managed to get a silver title sponsor for the techfest.\r\nManaged to get many other local sponsorships.\r\nField work was also very nice and got an experience to keep forward irrespective of failures and helped to improve myself from previous.\r\nGot some valuable lessons for communication skills and hospitatity management and got a knowledge on how to make people invest for our initiatives.\r\n\r\nBeing part of organizing committe helped to gain experience in multitasking, problem solving and public speaking.\r\n\r\nGot my first hands-on experience in digital marketing when handled the social media pages for such a big event.Got a chance to handle handle social media pages and being part of various committees for a national level techfest IHRD THARANG hosted in our college. Helped in gaining knowledge in problem solving and multitasking. Gained many connections and expert advices from all across the world. Being part of the sponsorship committee was something different. Got expert advices from proffessional alumni across the world and managed to make a connection with them. Me and my team partner managed to get a silver title sponsor for the techfest. Managed to get many other local sponsorships. Field work was also very nice and got an experience to keep forward irrespective of failures and helped to improve myself from previous. Got some valuable lessons for communication skills and hospitatity management and got a knowledge on how to make people invest for our initiatives. Being part of organizing committe helped to gain experience in multitasking, problem solving and public speaking. Got my first hands-on experience in digital marketing when handled the social media pages for such a big event.\r\nSkills: Digital Marketing · Social Media Marketing","proddec, alumni relations cell college of engineering chengannur, tharang ihrd, nss cec, techmaghie"],"location":"","interests":[]},{"userId":"66d32cb157fe60f99f033d8f","userName":"alumni3","experiences":[],"location":"","interests":[]},{"userId":"66dc82555ee3de97a886bd92","userName":"student3","experiences":[],"location":"","interests":[]},{"userId":"66dc829b5ee3de97a886bd94","userName":"student4","experiences":[],"location":"","interests":[]},{"userId":"66dc82fe5ee3de97a886bd98","userName":"alumni4","experiences":[],"location":"","interests":[]},{"userId":"66dc82cd5ee3de97a886bd96","userName":"student5","experiences":[],"location":"","interests":[]},{"userId":"66d0086957fe60f99f033d7f","userName":"student1","location":"kollam","interests":["guitar"]}]